# Конвертер емодзі

# Вступ

"""Ця програма перетворює текстові повідомлення, замінюючи певні слова на відповідні емодзі."""

# Використання

# Введення Повідомлення**

"""Користувач вводить текстове повідомлення з клавіатури."""

""" Введене повідомлення розбивається на окремі слова за допомогою пробілів.
Слова, які мають еквівалент в словнику emojis, замінюються на відповідні емодзі."""
def emoji_converter():
    message = input(">")
    words = message.split(" ")
    emojis = {
    ":)": "🙂",
    ":(": "🤧",
}
    output = ""
    for word in words:
        output += emojis.get(word, word) + " "
    return output

print(emoji_converter())


